<a href="https://colab.research.google.com/github/nptikiran/PythonBasic/blob/main/pd_DataFrme.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import pandas as pd
import numpy as np

In [2]:
# Creating dict
data_dict = {'Country' : ['Belgium','India','Brazil'],
             'Capital' : ['Brussel','New Delhi','Brasilia'],
             'Population' : [122020, 7774744, 3664838]}

# Converting dict into DataFrame          
df = pd.DataFrame(data_dict)
df # Calling Dataframe

   Country    Capital  Population
0  Belgium    Brussel      122020
1    India  New Delhi     7774744
2   Brazil   Brasilia     3664838

In [3]:
df.dtypes

Country       object
Capital       object
Population     int64
dtype: object

In [4]:
#Example-2

data_dict = { 'xcol1':[1, 2],'ycol2':[3,4],'zcol3':['a','b']}
df = pd.DataFrame(data_dict)
df

   xcol1  ycol2 zcol3
0      1      3     a
1      2      4     b

In [5]:
df.dtypes

xcol1     int64
ycol2     int64
zcol3    object
dtype: object

In [6]:
df.shape

(2, 3)

In [7]:
# Creating dict with Series data
data_dict = { 'one':pd.Series([1.,2.,3.], index = ['a','b','c']),
             'two':pd.Series([1.,2.,3.,4.], index = ['a','b','c','d'])}

# Convert dict into DataFrame
df = pd.DataFrame(data_dict)
df

   one  two
a  1.0  1.0
b  2.0  2.0
c  3.0  3.0
d  NaN  4.0

In [9]:
df = pd.DataFrame(data_dict, index = ['d','b','a'] )
df

   one  two
d  NaN  4.0
b  2.0  2.0
a  1.0  1.0

In [10]:
df = pd.DataFrame(data_dict, index = ['d','b','a'], columns = ['Python','Spark'])
df

  Python Spark
d    NaN   NaN
b    NaN   NaN
a    NaN   NaN

Here we have create new column python and spark which don't have any value. Because of which it shows NAN value.

In [12]:
df = pd.DataFrame(data_dict, index = ['d','b','a'], columns = ['one','two'])
df

   one  two
d  NaN  4.0
b  2.0  2.0
a  1.0  1.0

In [13]:
df.index

Index(['d', 'b', 'a'], dtype='object')

In [14]:
df.columns

Index(['one', 'two'], dtype='object')

In [15]:
# Constructing DataFrame from Array
data = {'one':[1.,2.,3.,4.],
        'two':[4.,3.,2.,1.]}

pd.DataFrame(data)

   one  two
0  1.0  4.0
1  2.0  3.0
2  3.0  2.0
3  4.0  1.0

In [16]:
pd.DataFrame(data, index=['a','b','c','d'])

   one  two
a  1.0  4.0
b  2.0  3.0
c  3.0  2.0
d  4.0  1.0

In [17]:
# Create DF from list
data = [{'a':1,'b':2},{'a':5,'b':10,'c':20}]

pd.DataFrame(data)

   a   b     c
0  1   2   NaN
1  5  10  20.0

In [18]:
pd.DataFrame(data, index=['first','second'])

        a   b     c
first   1   2   NaN
second  5  10  20.0

In [21]:
# Column selection, addition, delation
data = {'one' : pd.Series([1.,2.,3.], index = ['a','b','c']),
        'two' : pd.Series([1.,2.,3.,4.], index= ['d','b','c','a'])}
                                                
df = pd.DataFrame(data)
df

   one  two
a  1.0  4.0
b  2.0  2.0
c  3.0  3.0
d  NaN  1.0

In [22]:
# Column Selection
df['one']

a    1.0
b    2.0
c    3.0
d    NaN
Name: one, dtype: float64

In [26]:
df['three'] = df['one'] + df['two']
df

   one  two  three
a  1.0  4.0    5.0
b  2.0  2.0    4.0
c  3.0  3.0    6.0
d  NaN  1.0    NaN

In [28]:
df['flag'] = df['one'] >2
df

   one  two  three   flag
a  1.0  4.0    5.0  False
b  2.0  2.0    4.0  False
c  3.0  3.0    6.0   True
d  NaN  1.0    NaN  False

In [29]:
df['foo'] = 'bar'
df

   one  two  three   flag  foo
a  1.0  4.0    5.0  False  bar
b  2.0  2.0    4.0  False  bar
c  3.0  3.0    6.0   True  bar
d  NaN  1.0    NaN  False  bar

In [33]:
#Deletion
del df['flag']
df

   one  two  three
a  1.0  4.0    5.0
b  2.0  2.0    4.0
c  3.0  3.0    6.0
d  NaN  1.0    NaN

In [36]:
series1 = pd.Series([1,2,3,4,5], index=['a','b','c','d','e'])
series2 = pd.Series([1,2,3,4,5], index = ['c','e','f','g','h'])

In [37]:
series3 = series1 + series2
series3

a    NaN
b    NaN
c    4.0
d    NaN
e    7.0
f    NaN
g    NaN
h    NaN
dtype: float64

In [38]:
series3.isnull()

a     True
b     True
c    False
d     True
e    False
f     True
g     True
h     True
dtype: bool

In [39]:
series3.isnull().sum()

6

In [40]:
series3.dropna()

c    4.0
e    7.0
dtype: float64

In [41]:
series3.fillna(100)

a    100.0
b    100.0
c      4.0
d    100.0
e      7.0
f    100.0
g    100.0
h    100.0
dtype: float64

In [42]:
# Reading External file

df = pd.read_csv('/content/iris.csv')
df.head()

   sepal_length  sepal_width  petal_length  petal_width        class
0           5.1          3.5           1.4          0.2  Iris-setosa
1           4.9          3.0           1.4          0.2  Iris-setosa
2           4.7          3.2           1.3          0.2  Iris-setosa
3           4.6          3.1           1.5          0.2  Iris-setosa
4           5.0          3.6           1.4          0.2  Iris-setosa

In [50]:
# Assigning new column
# Here using assign()
df = df.assign(sepal_ratio = df['sepal_width']/df['petal_length'])

In [51]:
# Here create new column
df['sepal_ratio1'] = df.sepal_width/df.sepal_length

df.head()

   sepal_length  sepal_width  ...  sepal_ratio1  sepal_ratio
0           5.1          3.5  ...      0.686275     2.500000
1           4.9          3.0  ...      0.612245     2.142857
2           4.7          3.2  ...      0.680851     2.461538
3           4.6          3.1  ...      0.673913     2.066667
4           5.0          3.6  ...      0.720000     2.571429

[5 rows x 7 columns]

In [53]:
#Indexing/Selection/Row Selection

df.loc[1]

sepal_length            4.9
sepal_width               3
petal_length            1.4
petal_width             0.2
class           Iris-setosa
sepal_ratio1       0.612245
sepal_ratio         2.14286
Name: 1, dtype: object

In [54]:
df.loc[104]

sepal_length               6.5
sepal_width                  3
petal_length               5.8
petal_width                2.2
class           Iris-virginica
sepal_ratio1          0.461538
sepal_ratio           0.517241
Name: 104, dtype: object

In [55]:
# data alingment and arithmatic

df1 = pd.DataFrame(data=np.random.randn(10,4), columns = ['a','b','c','d'])
df2 = pd.DataFrame(data=np.random.randn(7,3), columns=['a','b','c'])
df1

          a         b         c         d
0  0.409799 -0.049909  0.134891 -0.532705
1 -0.395064  0.551074  1.722175 -1.125191
2 -0.763312 -0.323066  0.574734  0.961226
3 -0.901063 -0.332827 -0.350330  0.251627
4  0.247624  1.155045 -0.636313  0.793902
5 -0.080655 -0.752962 -1.098146 -0.071165
6 -1.306507  0.958615  2.455163 -1.035472
7 -0.704389  0.062746 -1.245454 -0.004446
8  0.791102 -0.315132 -2.121297 -0.407769
9 -0.081025 -1.864271 -1.872985 -1.039978

In [57]:
df3 = df1 + df2
df3

          a         b         c   d
0  0.422296  1.051963  0.087392 NaN
1 -0.913756  0.991750  3.204709 NaN
2 -1.263083  0.270300  1.289297 NaN
3 -1.583321 -1.841896  0.213825 NaN
4  1.320568 -0.515156 -0.186806 NaN
5 -0.129260 -3.638409 -0.687826 NaN
6 -0.839665  0.853281  3.955746 NaN
7       NaN       NaN       NaN NaN
8       NaN       NaN       NaN NaN
9       NaN       NaN       NaN NaN

In [60]:
df1[['a','b']]

          a         b
0  0.409799 -0.049909
1 -0.395064  0.551074
2 -0.763312 -0.323066
3 -0.901063 -0.332827
4  0.247624  1.155045
5 -0.080655 -0.752962
6 -1.306507  0.958615
7 -0.704389  0.062746
8  0.791102 -0.315132
9 -0.081025 -1.864271

In [61]:
df3[['a','b']]

          a         b
0  0.422296  1.051963
1 -0.913756  0.991750
2 -1.263083  0.270300
3 -1.583321 -1.841896
4  1.320568 -0.515156
5 -0.129260 -3.638409
6 -0.839665  0.853281
7       NaN       NaN
8       NaN       NaN
9       NaN       NaN

In [64]:
# Boolean Operator
df1 = pd.DataFrame({'a':[1,0,1],'b':[0,0,1]}, dtype=bool)
df2 = pd.DataFrame({'a':[1,0,0],'b':[1,1,0]},dtype=bool)

In [65]:
df3 = df1 + df2
df3

/usr/local/lib/python3.7/dist-packages/pandas/core/computation/expressions.py:204: UserWarning: evaluating in Python space because the '+' operator is not supported by numexpr for the bool dtype, use '|' instead
  f"evaluating in Python space because the {repr(op_str)} "

       a     b
0   True  True
1  False  True
2   True  True

In [66]:
# AND operator sets each bit to 1 if both bits are 1
df1 & df2

       a      b
0   True  False
1  False  False
2  False  False

In [67]:
# OR operator set each bit to 1 if one of two bits is 1
df1 | df2

       a     b
0   True  True
1  False  True
2   True  True

In [68]:
# XOR set each bit to 1 if only one of two bits is 1 
df1 ^ df2

       a     b
0  False  True
1  False  True
2   True  True

In [69]:
-df1

       a      b
0  False   True
1   True   True
2  False  False

In all above compairing b column with n

In [70]:
# Transposing

df =  pd.DataFrame(np.random.randn(8, 3), columns=list('ABC'))
df

          A         B         C
0  1.205226  2.024624 -0.701432
1  0.452315 -0.287530  0.207938
2  0.283926 -0.973749 -1.001599
3  1.271802 -0.503197  1.849223
4 -1.255366 -0.783684 -0.493252
5 -1.832468 -0.505066  1.668946
6 -0.907511  0.126342  0.724804
7  0.265758  0.226257 -1.493585

In [71]:
df.T

          0         1         2  ...         5         6         7
A  1.205226  0.452315  0.283926  ... -1.832468 -0.907511  0.265758
B  2.024624 -0.287530 -0.973749  ... -0.505066  0.126342  0.226257
C -0.701432  0.207938 -1.001599  ...  1.668946  0.724804 -1.493585

[3 rows x 8 columns]